export default {
    state: {
        homeCards: [{
            id: 0,
            title: 'Всего в столице обитает около 200 видов дневных и ночных бабочек, более 90 из них занесены в Красную книгу Москвы.',
            author: 'Амега Амога',
            views: 13,
            comment: 3,
            like: 8,
            dislike: 2,
            desc: 'Социально-экономическое развитие требует определения и уточнения приоритизации разума над эмоциями. Сложно сказать, почему стремящиеся вытеснить традиционное производство, нанотехнологии формируют глобальную экономическую сеть и при этом -  объявлены нарушающими общечеловеческие нормы этики и морали. Являясь всего лишь частью общей картины, базовые сценарии поведения пользователей и по сей день остаются уделом либералов, которые жаждут быть смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности. Банальные, но неопровержимые выводы, а также интерактивные прототипы лишь добавляют фракционных разногласий и представлены в исключительно положительном свете. В частности, убеждённость некоторых оппонентов прекрасно подходит для реализации первоочередных требований.',
            dateTime: '19 часов назад'
        }, {
            id: 1,
            title: 'Компьютерные атаки и технологии их обнаружения',
            author: 'Амега Амога',
            views: 13,
            comment: 3,
            like: 8,
            dislike: 2,
            desc: 'Социально-экономическое развитие требует определения и уточнения приоритизации разума над эмоциями. Сложно сказать, почему стремящиеся вытеснить традиционное производство, нанотехнологии формируют глобальную экономическую сеть и при этом -  объявлены нарушающими общечеловеческие нормы этики и морали. Являясь всего лишь частью общей картины, базовые сценарии поведения пользователей и по сей день остаются уделом либералов, которые жаждут быть смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности. Банальные, но неопровержимые выводы, а также интерактивные прототипы лишь добавляют фракционных разногласий и представлены в исключительно положительном свете. В частности, убеждённость некоторых оппонентов прекрасно подходит для реализации первоочередных требований.',
            dateTime: '19 часов назад'
        }, {
            id: 2,
            title: 'В Санкт-Петербурге началась реконструкция памятника',
            author: 'Амега Амога',
            views: 13,
            comment: 3,
            like: 8,
            dislike: 2,
            desc: 'Социально-экономическое развитие требует определения и уточнения приоритизации разума над эмоциями. Сложно сказать, почему стремящиеся вытеснить традиционное производство, нанотехнологии формируют глобальную экономическую сеть и при этом -  объявлены нарушающими общечеловеческие нормы этики и морали. Являясь всего лишь частью общей картины, базовые сценарии поведения пользователей и по сей день остаются уделом либералов, которые жаждут быть смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности. Банальные, но неопровержимые выводы, а также интерактивные прототипы лишь добавляют фракционных разногласий и представлены в исключительно положительном свете. В частности, убеждённость некоторых оппонентов прекрасно подходит для реализации первоочередных требований.',
            dateTime: '19 часов назад'
        }, {
            id: 3,
            title: 'Список новых  бесплатных коворков в Москве',
            author: 'Амега Амога',
            views: 13,
            comment: 3,
            like: 8,
            dislike: 2,
            desc: 'Социально-экономическое развитие требует определения и уточнения приоритизации разума над эмоциями. Сложно сказать, почему стремящиеся вытеснить традиционное производство, нанотехнологии формируют глобальную экономическую сеть и при этом -  объявлены нарушающими общечеловеческие нормы этики и морали. Являясь всего лишь частью общей картины, базовые сценарии поведения пользователей и по сей день остаются уделом либералов, которые жаждут быть смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности. Банальные, но неопровержимые выводы, а также интерактивные прототипы лишь добавляют фракционных разногласий и представлены в исключительно положительном свете. В частности, убеждённость некоторых оппонентов прекрасно подходит для реализации первоочередных требований.',
            dateTime: '19 часов назад'
        }, {
            id: 4,
            title: 'В Волгограде появились первые подснежники',
            author: 'Амега Амога',
            views: 13,
            comment: 3,
            like: 8,
            dislike: 2,
            desc: 'Социально-экономическое развитие требует определения и уточнения приоритизации разума над эмоциями. Сложно сказать, почему стремящиеся вытеснить традиционное производство, нанотехнологии формируют глобальную экономическую сеть и при этом -  объявлены нарушающими общечеловеческие нормы этики и морали. Являясь всего лишь частью общей картины, базовые сценарии поведения пользователей и по сей день остаются уделом либералов, которые жаждут быть смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности. Банальные, но неопровержимые выводы, а также интерактивные прототипы лишь добавляют фракционных разногласий и представлены в исключительно положительном свете. В частности, убеждённость некоторых оппонентов прекрасно подходит для реализации первоочередных требований.',
            dateTime: '19 часов назад',
        }],
    },
    getters: {
        allHomeCards(state) {
            return state.homeCards
        },
        homeCardIndex: (state) => (index) => {
            return state.homeCards[index]
        }
    },
    mutations: {
        updateHomeCards(state, cards) {
            state.posts = cards
        }
    },
    actions: {},
    modules: {}
}